#연습문제 8.1
x1 <- c(175,210,192,250,245,226,260,230,205,185)
x2 <- c(15,18,20,28,25,21,32,25,24,19)
y <- c(120.4,112.5,95.4,162.3,160.2,131.5,157.6,158.4,149.6,130.4)

#(1)
Ex8.1 <- lm(y~x1+x2)
summary(Ex8.1)

#y=35.3359 + 0.2048x1 + 2.5506x2

#(2)
a=c(1,1,1,1,1,1,1,1,1,1)
X <- matrix(c(a,x1,x2),10,3)
t(X)
t(X)%*%X
solve(t(X)%*%X)

#var(b0)=8.99974754σ^2
#var(b1)=0.000637595σ^2
#var(b2)=0.020799716σ^2

#(3)
#x1,x2가 1만큼 변화했을 때 y에 미치는 영향을 의미한다. |b1|,|b2|가 높을 수록 그 영향력은 커진다.

#(4)
confint(Ex8.1,level=0.95)
#B1 = (-0.7612855 , 1.170788)
#B2 = (-2.9669628 , 8.068228)

#(5)
anova(Ex8.1)
((2747.54 + 312.78) / 2) / 261.77 #F0
#F0=5.845437 > F(2,7,0.05)=4.74 이므로 H0를 기각한다.

#(6)
predict(Ex8.1,data.frame(x1=200,x2=20),interval="prediction")
#(86.41531 , 168.1821)

#(7)
#H0:B1-B2=0
q <- matrix(c(0,1,-1),3,1)
b <- matrix(c(35.3359,0.2048,2.5506),3,1) 
t(q)%*%b
MSE = sum(Ex8.1$residuals^2)/7
MSE
#t0=(t(q)%*%b)-t(q)%*%B = 0/(sqrt(t(q)%*%solve(t(X)%*%X)%*%q*MSE))에서, H0에 의해 t(q)%*%B = 0이므로, t0=(t(q)%*%b)/(sqrt(t(q)%*%solve(t(X)%*%X)%*%q*MSE))
t0=(t(q)%*%b)/(sqrt(t(q)%*%solve(t(X)%*%X)%*%q%*%MSE))
t0
#-0.867669 < t(7;0.025) = 2.365이므로 H0를 채택한다.

#(8)
predict(Ex8.1,data.frame(x1=240,x2=30),interval="prediction")
#(114.5839 , 207.4063)


#연습문제 8.10
x1 <- c(2,2,3,3,2,2,3,3)
x2 <- c(4,4,4,4,6,6,6,6)
y <- c(39,42,51,48,53,49,61,60)

#(1)
full8.10 <- lm(y~x1+x2)
summary(full8.10)

#y = 0.375 + 9.25x1 + 5.375x2

#(2)
redX1 <- lm(y~x1)
summary(redX1)
#y=27.25 + 9.25x1

anova(redX1,full8.10)

#(3)
redX2 <- lm(y~x2)
summary(redX2)
#y=23.5 + 5.375x2

anova(redX2,full8.10)

#(4)
#install.packages('lm.beta')
library(lm.beta)
beta8.10<- lm.beta(full8.10)
summary(beta8.10)
#y=0.6384057x1 + 0.7419309x2

#(5)
anova(beta8.10)

#(6)
mean(x1)
S11 = 8*(0.5^2)
mean(x2)
S22 = 8*1
S12 = 4*(-0.5*1) + 4*(0.5*1)

r12 = S12/sqrt(S11*S22)
r12

R=matrix(c(1,r12,r12,1),2,2)
R
#r12가 0이되므로 x1,x2간 상관이 존재하지 않는다.


#연습문제 8.15
x1 <- c(-5,4,-1,2,2,3,3)
x2 <- c(5,4,1,-3,-2,-2,-3)
y <- c(11,11,8,2,5,5,4)

#(1)
Ex8.15 <- lm(y~x1+x2)
anova(Ex8.15)
((15.879 + 54.734) / 2) / 0.775 #F0
#F0 = 45.55677 > F(2,4,0.05) = 6.94 이므로 H0 기각한다.

#(2)
summary(Ex8.15)
#y = 6.4331 + 0.121x1 + 1.077x2
b=c(6.4331,0.121,1.077)
a <- c(1,1,1,1,1,1,1)
X <- matrix(c(a,x1,x2),7,3)
X

R_B0_B1_B2 <- b%*%t(X)%*%y
R_B0_B1_B2 #R(B0,B1,B2)

b=6.4331
X <- a
R_B0 <-  b%*%t(X)%*%y
R_B0 #R(B0)

R_B0_B1_B2 - R_B0 #R(B1,B2|B0)

b=c(6.4331,0.121)
X <- matrix(c(a,x1),7,2)
R_B0_B1 <-  b%*%t(X)%*%y
R_B0_B1

R_B0_B1 - R_B0 #R(B1|B0)

b=c(6.4331,1.077)
X <- matrix(c(a,x2),7,2)
R_B0_B2 <-  b%*%t(X)%*%y
R_B0_B2

R_B0_B2 - R_B0 #R(B2|B0)

#R(B0) = 295.9226
#R(B1,B2|B0) = 76.975
#R(B1|B0) = 2.662
#R(B2|B0) = 74.313

#(3)
redX2 <- lm(y~x2)
anova(redX2,Ex8.15)
#p-value가 0.4293으로 H0:B1 = 0를 유의수준 0.05에서 채택한다.

#(4)
redX1 <- lm(y~x1)
anova(redX1,Ex8.15)
#p-value가 0.001098으로 H0:B2 = 0를 유의수준 0.05에서 기각한다. 유의수준 0.01에서는 채택한다.

