#7.1
X <- matrix(c(1,1,1,1,1,1,1,1,1,4.2,3.8,4.8,3.4,4.5,4.6,4.3,3.7,3.9),9,2)
Y <- matrix(c(2.8,2.5,3.1,2.1,2.9,2.6,2.4,2.4,2.5),9,1)

#(1)
t(X)%*%X

#(2)
solve(t(X)%*%X)

#(3)
t(X)%*%Y

#(4)
b=solve(t(X)%*%X)%*%t(X)%*%Y
b

#7.7
y=c(64,71,53,67,55,58,77,57,56,51,76,68)
x1=c(57,59,49,62,51,50,55,48,42,42,61,57)
x2=c(8,10,6,11,8,7,10,9,10,6,12,9)

#(1)
plot(x1,y)
plot(x2,y)
plot(x1,x2)

cor(x1,y)
cor(x2,y)
cor(x1,x2)

#(2)
fit1 <- lm(y~x1)
summary(fit1)
sum((fit1$residuals)^2) 

#y(hat)= 6.1898 + 1.0722x1, SSE = 229.3275

#(3)
fit2 <- lm(y~x2)
summary(fit2)
sum((fit2$residuals)^2)

#y(hat)= 30.5714 + 3.6429x2, SSE = 361.8571

#(4)
fit3 <- lm(y~x1+x2)
summary(fit3)
sum((fit3$residuals)^2)

#y(hat)= 6.5530 + 0.7220x1 + 2.0501x2, SSE = 195.4274

#(5)
#변수 x2보다 x1을 활용하여 중회귀모형을 추정할 때 잔차제곱합이 더 낮았고, 변수 x1,x2를 같이 활용하여 추정할 때는 잔차제곱합 값이 더 낮아졌다. 이를 보아 더 많은 독립변수를 넣어 중회귀모형을 추정할수록 잔차제곱합이 줄어드는 모습을 확인할 수 있다.

#7.10
y <- c(6,8,1,0,5,3,2,-4,10,-3,5)
x1 <- c(1,4,9,11,3,8,5,10,2,7,6)
x2 <- c(8,2,-8,-10,6,-6,0,-12,4,-2,-4)

#(1)
fit <- lm(y~x1+x2)
summary(fit)
#y(hat)= 14 - 2x1 - 0.5x2

#(2)
n=11
k=2
MSE <- sum((fit$residuals)^2)/(n-k-1)
MSE

var_hat=MSE*(n-k-1)/n
var_hat

X <- matrix(c(1,1,1,1,1,1,1,1,1,1,1,x1,x2),11,3)

var_b=solve(t(X)%*%X)*var_hat
var_b

#1) var(b1) = 1.0445469, var(b2) = 0.2611367

var_b1 = 1.0445469
var_b2 = 0.2611367
3*var_b1 + 5*var_b2

#2) 4.439324
